Tekla.Structures.Model.RebarLapping.LappingTypeEnum
The lapping type.

Tekla.Structures.Model.RebarLapping.LappingTypeEnum.CUSTOM_LAPPING
Custom lapping.

Tekla.Structures.Model.RebarLapping.LappingTypeEnum.STANDARD_LAPPING
Standard lapping.